const ap = new APlayer({
    container: document.getElementById('aplayer'), //播放器容器元素
    mini: true, //迷你模式
    fixed: true, //吸底模式
    autoplay: false, //自动播放
    theme: '#FADFA3', //主题色
    loop: 'all', //音频循环播放, 可选值: 'all'全部循环, 'one'单曲循环, 'none'不循环
    order: 'random', //音频循环顺序, 可选值: 'list'列表循环, 'random'随机循环
    preload: 'auto', //预加载，可选值: 'none', 'metadata', 'auto'
    volume: 0.7, //默认音量，请注意播放器会记忆用户设置，用户手动设置音量后默认音量即失效
    mutex: true, //互斥，阻止多个播放器同时播放，当前播放器播放时暂停其他播放器
    listFolded: true, //列表默认折叠
    listMaxHeight: 90, //列表最大高度
    lrcType: 1, //歌词传递方式
    audio: [ //音频信息,包含以下
        {
            name: '千里邀月（人声本家）', //音频名称
            artist: '泠鸢yousa / 茶理理 / Hanser / 三无MarBlue', //音频艺术家
            url: 'http://music.163.com/song/media/outer/url?id=1334591437.mp3', //音频外链
            cover: 'http://p1.music.126.net/4zluTz1ckuBWIbWHzc5xQA==/109951163736812658.jpg', //音频封面
            lrc: '[00:00.019] 作词 : 千月兔\n[00:00.57]出品：超电文化\n[00:00.57]策划/监制：小爱@木冢爱\n[00:00.57]编曲：纯白P\n[00:00.57]二胡：陆二胡\n[00:00.57]笛子：水玥儿\n[00:00.57]曲绘：井寒子\n[00:00.57]映像：系豆沙\n[00:00.57]混音：Irecorder/三星堆工作室\n[00:00.57]音乐指导：bilbili音乐@大家的音乐姬\n[00:05.15]【茶】长生殿外自在躲清闲\n[00:08.19]【茶】忽闻三生路魂灯不灭\n[00:12.35]【茶】好奇是谁的真情感动上天\n[00:16.04]【茶】且等我 探一遭 这人间\n[00:19.58]\n[00:35.00]【憨】一声锣惊得我睁大双眼\n[00:38.60]【憨】茶楼酒肆铺满闹市长街\n[00:42.49]【憨】桂花酒香便与人潮交叠\n[00:46.23]【憨】乌篷江岸佳人一曲传遍\n[00:50.02]【鸟】食客翘首等一碗阳春面\n[00:53.70]【鸟】墨客满腹才情廊下邀月\n[00:57.35]【鸟】公子执扇翩翩小姐掩面\n[01:01.09]【鸟】苦于灯谜却留风情不解\n[01:04.88]【三】我曾一心向往天上的明月\n[01:08.67]【三】怕今宵是庄生的蝴蝶\n[01:12.57]【三】梦碎了冷冷清清的宫阙\n[01:16.05]【合】不免嫉妒人间 阴晴圆缺\n[01:19.59]【鸟】有人庙中求一线姻缘\n[01:22.63]【茶】有人为前程寒窗十年\n[01:26.52]【憨】有红颜惊艳时光辜负岁月\n[01:30.67]【三】到头来 一声叹 一生憾\n[01:34.20]【茶三】有人将权贵声望贪恋\n[01:37.64]【鸟憨】有人在福中浑然不觉\n[01:41.33]【合】有英雄漂泊异乡 故土遥远\n[01:45.62]【三】同赏此月 夜不眠\n[01:49.57]\n[02:06.55]【茶三】满城灯火映面丝竹不歇\n[02:10.35]【鸟憨】一晃三更过半今夕何年\n[02:13.93]【茶三】今朝有酒今朝醉倒花间\n[02:17.67]【鸟憨】何必苦苦追寻某种机缘\n[02:21.41]【茶三】谁家捣药的月兔顾影自怜\n[02:25.10]【鸟憨】幻化成人红尘间流连\n[02:28.94]【茶三】说书的将神话坊间传遍\n[02:32.44]【鸟憨】殊不知逗笑了哪路神仙\n[02:36.02]【鸟】有人庙中求一线姻缘\n[02:39.26]【憨】有人为前程寒窗十年\n[02:42.85]【茶】有红颜惊艳时光辜负岁月\n[02:47.34]【三】到头来 一声叹 一生憾\n[02:50.73]【茶三】有人将权贵声望贪恋\n[02:54.42]【鸟憨】有人在福中浑然不觉\n[02:57.75]【合】有英雄漂泊异乡 故土遥远\n[03:02.36]【三】同赏此月 夜不眠\n[03:06.85]【憨】天上数日换作尘世百年\n[03:10.65]【憨】一瞬清风擦面\n[03:13.98]【茶】何故撩拨我心弦\n[03:16.46]【茶】凌霄宝殿怎及【憨茶三】阑珊处烟火点点\n[03:21.47]【鸟】长生殿外自在躲清闲\n[03:24.86]【茶】忽闻三生路魂灯不灭\n[03:28.75]【三】又是谁的真情感动了上天\n[03:32.89]【合】不如我 再一探 这人间\n[03:36.37]【合】有情人尝过离合悲欢\n[03:39.87]【合】有知己结伴江山览遍\n[03:43.61]【合】有好酒好歌共我玩乐消遣\n[03:48.00]【合】共饮此杯 赏此月 夜好眠\n[03:53.86]\n', //音频歌词，配合上面的lrcType使用
            theme: '#ebd0c2' //切换到此音频时的主题色，比上面的 theme 优先级高
        }
    ]
});
